wah-baru/mini-dcu/Atmel/AtMega2560/GuruxDLMSClientExample/GuruxDLMSClientExample/main.c
//
// --------------------------------------------------------------------------
//  Gurux Ltd
//
//
//
// Filename:        $HeadURL$
//
// Version:         $Revision$,
//                  $Date$
//                  $Author$
//
// Copyright (c) Gurux Ltd
//
//---------------------------------------------------------------------------
//
//  DESCRIPTION
//
// This file is a part of Gurux Device Framework.
//
// Gurux Device Framework is Open Source software; you can redistribute it
// and/or modify it under the terms of the GNU General Public License
// as published by the Free Software Foundation; version 2 of the License.
// Gurux Device Framework is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
// See the GNU General Public License for more details.
//
// This code is licensed under the GNU General Public License v2.
// Full text may be retrieved at http://www.gnu.org/licenses/gpl-2.0.txt
//---------------------------------------------------------------------------

#include <xc.h>
#include <avr/io.h>
#include <time.h>
#include "dlms/include/gxignore.h"
#include "dlms/include/client.h"
#include "dlms/include/serverevents.h"
#include "dlms/include/dlmssettings.h"
#include "dlms/include/gxvalueeventargs.h"
#include "dlms/include/gxObjects.h"
#include "dlms/include/bytebuffer.h"
#include "dlms/include/variant.h"
#include "dlms/include/objectarray.h"
#include "dlms/include/cosem.h"
//obj_toString requires this
#include "dlms/include/converters.h"
#include "dlms/include/helpers.h"

#define F_CPU	16000000UL

/**
 * \brief Set the desired baud rate value
 *
 * set the desired baudrate, the define is used by the util/setbaud.h to calculate the
 * register values.
 */
#define BAUD 9600

//set the baud rate tolerance to 2%
#define BAUD_TOL 2

//define the UART data buffer ready interrupt vector
#define UART0_DATA_EMPTY_IRQ USART0_UDRE_vect

#ifdef UBRR1H
//define the UART data buffer ready interrupt vector.
//This is used for debugging.
#define UART1_DATA_EMPTY_IRQ USART1_UDRE_vect
#endif //UBRR1H

//! define the UART data
#define UART0_RX_IRQ USART0_RX_vect
#include <util/setbaud.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <stdio.h>

//DLMS settings.
dlmsSettings settings;

//Is new data available for read in the UART.
volatile unsigned char available = 0;

//How long reply is waited from the meter.
const uint32_t WAIT_TIME = 2000;
//How many times message is try to resend to the meter.
const uint8_t RESEND_COUNT = 3;

//Is trace used.
static GX_TRACE_LEVEL trace = GX_TRACE_LEVEL_VERBOSE;
//Received data.
static gxByteBuffer frameData;

volatile unsigned long milliseconds;

ISR(TIMER1_COMPA_vect)
{
	++milliseconds;
	if (milliseconds % 1000 == 0)
	{
		system_tick();
	}
}

unsigned long millis(void)
{
	return milliseconds;
}

#ifdef UBRR1H
/**
 * \brief Function for putting a char in the trace UART buffer
 *
 * \param data the data to add to the trace UART buffer and send
 *
 */
static inline void uart_putTraceChar(uint8_t data)
{
	//Wait until data is written.
	while ((UCSR1B & (1 << UDRIE1)) != 0)
	{
		_delay_ms(10);		
	}
	/* Disable interrupts */
	cli();
	UDR1 = data;
	// First data in buffer, enable data ready interrupt
	UCSR1B |= (1 << UDRIE1);
	/* Enable interrupts */
	sei();
}
#endif //UBRR1H

/**
 * \brief Function for putting a char in the UART buffer
 *
 * \param data the data to add to the UART buffer and send.
 *
 */
static inline int uart_traceWrite(const char* data)
{
#ifdef UBRR1H	
	if (data != NULL)
	{		
		int pos, len = strlen(data);
		for(pos = 0; pos < len; ++pos)
		{
			uart_putTraceChar(data[pos]);
		}
	}
#endif //UBRR1H
	return 0;
}

///////////////////////////////////////////////////////////////////////
// Write trace to the serial port.
//
// This can be used for debugging.
///////////////////////////////////////////////////////////////////////
void GXTRACE(const char* str, const char* data)
{
	if (trace == GX_TRACE_LEVEL_VERBOSE)
	{
		time_t tm = time(NULL);
		uart_traceWrite((const char*) "\t:");
		uart_traceWrite(asctime(gmtime(&tm)));
		uart_traceWrite((const char*) "\t");
		uart_traceWrite(str);
		uart_traceWrite(data);
		uart_traceWrite((const char*) "\0");
		_delay_ms(10);		
	}
}

///////////////////////////////////////////////////////////////////////
// Write trace to the serial port.
//
// This can be used for debugging.
///////////////////////////////////////////////////////////////////////
void GXTRACE_INT(const char* str, int32_t value)
{
	char data[10];
	sprintf(data, " %ld", value);
	GXTRACE(str, data);
}

int com_readSerialPort(
  unsigned char eop)
{
  //Read reply data.
  uint16_t pos;
  unsigned char eopFound = 0;
  uint16_t lastReadIndex = frameData.position;
  uint32_t start = millis();
  do
  {
    if (available)
    {
      //Search eop.
      if (frameData.size > 5)
      {
        //Some optical strobes can return extra bytes.
        for (pos = frameData.size - 1; pos != lastReadIndex; --pos)
        {
          if (frameData.data[pos] == eop)
          {
            eopFound = 1;
            break;
          }
        }
        lastReadIndex = pos;
      }
    }
    else
    {
      _delay_ms(50);
    }
    //If the meter doesn't reply in given time.
    if (!(millis() - start < WAIT_TIME))
    {
      GXTRACE_INT(GET_STR_FROM_EEPROM("Received bytes: \n"), frameData.size);
      return DLMS_ERROR_CODE_RECEIVE_FAILED;
    }
  } while (eopFound == 0);
  return DLMS_ERROR_CODE_OK;
}


/**
 * \brief Function for putting a char in the UART buffer
 *
 * \param data the data to add to the UART buffer and send
 *
 */
static inline void uart_putchar(uint8_t data)
{
	//Wait until data is written.
	while ((UCSR0B & (1 << UDRIE0)) != 0)
	{
		_delay_ms(10);		
	}
	UDR0 = data;
	// First data in buffer, enable data ready interrupt
	UCSR0B |= (1 << UDRIE0);
}

/**
 * \brief Function for putting a char in the UART buffer
 *
 * \param data the data to add to the UART buffer and send.
 *
 */
static inline int uart_write(gxByteBuffer* data)
{
	while (data->position < data->size)
	{
		uart_putchar(data->data[data->position]);
		++data->position;
	}
	return 0;
}


// Read DLMS Data frame from the device.
int readDLMSPacket(
  gxByteBuffer* data,
  gxReplyData* reply)
{
  int resend = 0, ret = DLMS_ERROR_CODE_OK;
  if (data->size == 0)
  {
    return DLMS_ERROR_CODE_OK;
  }
  reply->complete = 0;
  frameData.size = 0;
  frameData.position = 0;
  //Send data.
  if ((ret = uart_write(data)) != 0)
  {
    //If failed to write all bytes.
    GXTRACE(GET_STR_FROM_EEPROM("Failed to write all data to the serial port.\n"), NULL);
  }
  //Loop until packet is complete.
  do
  {
    if ((ret = com_readSerialPort(0x7E)) != 0)
    {
      if (ret == DLMS_ERROR_CODE_RECEIVE_FAILED && resend == RESEND_COUNT)
      {
        return DLMS_ERROR_CODE_SEND_FAILED;
      }
      ++resend;
      GXTRACE_INT(GET_STR_FROM_EEPROM("Data send failed. Try to resend."), resend);
	  if ((ret = uart_write(data)) != 0)
      {
        //If failed to write all bytes.
        GXTRACE(GET_STR_FROM_EEPROM("Failed to write all data to the serial port.\n"), NULL);
      }
    }
    ret = cl_getData(&settings, &frameData, reply);
    if (ret != 0 && ret != DLMS_ERROR_CODE_FALSE)
    {
      break;
    }
  } while (reply->complete == 0);
  return ret;
}

int com_readDataBlock(
  message* messages,
  gxReplyData* reply)
{
  gxByteBuffer rr;
  int pos, ret = DLMS_ERROR_CODE_OK;
  //If there is no data to send.
  if (messages->size == 0)
  {
    return DLMS_ERROR_CODE_OK;
  }
  BYTE_BUFFER_INIT(&rr);
  //Send data.
  for (pos = 0; pos != messages->size; ++pos)
  {
    //Send data.
    if ((ret = readDLMSPacket(messages->data[pos], reply)) != DLMS_ERROR_CODE_OK)
    {
      return ret;
    }
    //Check is there errors or more data from server
    while (reply_isMoreData(reply))
    {
      if ((ret = cl_receiverReady(&settings, reply->moreData, &rr)) != DLMS_ERROR_CODE_OK)
      {
        bb_clear(&rr);
        return ret;
      }
      if ((ret = readDLMSPacket(&rr, reply)) != DLMS_ERROR_CODE_OK)
      {
        bb_clear(&rr);
        return ret;
      }
      bb_clear(&rr);
    }
  }
  return ret;
}

//Close connection to the meter.
int com_close()
{
  int ret = DLMS_ERROR_CODE_OK;
  gxReplyData reply;
  message msg;
  reply_init(&reply);
  mes_init(&msg);
  if ((ret = cl_releaseRequest2(&settings, &msg, 1)) != 0 ||
      (ret = com_readDataBlock(&msg, &reply)) != 0)
  {
    //Show error but continue close.
  }
  reply_clear(&reply);
  mes_clear(&msg);

  if ((ret = cl_disconnectRequest(&settings, &msg)) != 0 ||
      (ret = com_readDataBlock(&msg, &reply)) != 0)
  {
    //Show error but continue close.
  }
  reply_clear(&reply);
  mes_clear(&msg);
  return ret;
}

//Initialize connection to the meter.
int com_initializeConnection()
{
  int ret = DLMS_ERROR_CODE_OK;
  message messages;
  gxReplyData reply;
  mes_init(&messages);
  reply_init(&reply);

  //Get meter's send and receive buffers size.
  if ((ret = cl_snrmRequest(&settings, &messages)) != 0 ||
      (ret = com_readDataBlock(&messages, &reply)) != 0 ||
      (ret = cl_parseUAResponse(&settings, &reply.data)) != 0)
  {
    mes_clear(&messages);
    reply_clear(&reply);
    return ret;
  }
  mes_clear(&messages);
  reply_clear(&reply);
  if ((ret = cl_aarqRequest(&settings, &messages)) != 0 ||
      (ret = com_readDataBlock(&messages, &reply)) != 0 ||
      (ret = cl_parseAAREResponse(&settings, &reply.data)) != 0)
  {
    mes_clear(&messages);
    reply_clear(&reply);
    if (ret == DLMS_ERROR_CODE_APPLICATION_CONTEXT_NAME_NOT_SUPPORTED)
    {
      return ret;
    }
    return ret;
  }
  mes_clear(&messages);
  reply_clear(&reply);
  // Get challenge Is HLS authentication is used.
  if (settings.authentication > DLMS_AUTHENTICATION_LOW)
  {
    if ((ret = cl_getApplicationAssociationRequest(&settings, &messages)) != 0 ||
        (ret = com_readDataBlock(&messages, &reply)) != 0 ||
        (ret = cl_parseApplicationAssociationResponse(&settings, &reply.data)) != 0)
    {
      mes_clear(&messages);
      reply_clear(&reply);
      return ret;
    }
    mes_clear(&messages);
    reply_clear(&reply);
  }
  return DLMS_ERROR_CODE_OK;
}

