wah-baru/mini-dcu/Atmel/AtMega2560/GuruxDLMSClientExample/GuruxDLMSClientExample/main.c
#if USE_2X
	UCSR0A |= (1 << U2X0);
#endif

	// enable RX and TX and set interrupts on rx complete
	UCSR0B = (1 << RXEN0) | (1 << TXEN0) | (1 << RXCIE0);

	// 8-bit, 1 stop bit, no parity, asynchronous UART
	UCSR0C = (1 << UCSZ01) | (1 << UCSZ00) | (0 << USBS0) |
			(0 << UPM01) | (0 << UPM00) | (0 << UMSEL01) |
			(0 << UMSEL00);	
}

//If debug serial port is available.
#ifdef UBRR1H
/**
 * \brief Initialize the UART for debugging with settings: 9600 8None1
 */
static void uart_debugInit(void)
{
	if (trace == GX_TRACE_LEVEL_VERBOSE)
	{
		UBRR1H = UBRRH_VALUE;
		UBRR1L = UBRRL_VALUE;
	#if USE_2X
		UCSR1A |= (1 << U2X1);
	#endif
		// enable TX only.
		UCSR1B = (1 << TXEN1);
		// 8-bit, 1 stop bit, no parity
		UCSR1C = (1 << UCSZ10) | (1 << UCSZ11);
	}
}
#endif //UBRR1H

// Calculate the value needed for the CTC match value in OCR1A.
#define CTC_MATCH_OVERFLOW ((F_CPU / 1000) / 8)

//Init timer.
static void timer_init(void)
{
	// CTC mode, Clock/8
	TCCR1B |= (1 << WGM12) | (1 << CS11);

	// Load the high byte, then the low byte
	// into the output compare
	OCR1AH = (CTC_MATCH_OVERFLOW >> 8);
	OCR1AL = CTC_MATCH_OVERFLOW;

	// Enable the compare match interrupt
	TIMSK1 |= (1 << OCIE1A);
}

int main(void)
{
	uart_init();
#ifdef UBRR1H
	uart_debugInit();
#endif //UBRR1H
	timer_init();
	/* Enable interrupts */
	sei();

	cl_init(&settings, 1, 16, 1, DLMS_AUTHENTICATION_NONE, NULL, DLMS_INTERFACE_TYPE_HDLC);
	GXTRACE(GET_STR_FROM_EEPROM("Start application"), NULL);
	BYTE_BUFFER_INIT(&frameData);
	//Set frame capacity.
	bb_capacity(&frameData, 128);
	while(1)
	{		
		com_readAllObjects();
		_delay_ms(1000);	
	}
}